---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsType.RunType
source: html/06c12f95-76c2-8c0f-8124-e4bc15abb080.htm
---
# Autodesk.Revit.DB.Architecture.StairsType.RunType Property

The type for all runs in the stair element.

## Syntax (C#)
```csharp
public ElementId RunType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The specified runTypeId is not a valid run type.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null